Revit 2026 API

# Categories Properties

---

The Categories type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Whether or not the list of top-level categories is empty.(Overrides CategoryNameMapIsEmpty) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | ItemBuiltInCategory | Retrieves a category object corresponding to a BuiltInCategory id. |
|  | ItemString | Gets a category which has the specified name from this list of top-level categories.(Overrides CategoryNameMapItemString) |
|  | Size | The total number of top-level categories in the document.(Overrides CategoryNameMapSize) |

#### Reference

Categories Class

Autodesk.Revit.DB Namespace